; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_1 type_2)
 (:predicates (pred_3 ?v8 - type_1 ?v2 - type_3)
 	      (pred_4 ?v3 - object ?v2 - type_3)
	      (pred_1 ?v8 - type_1 ?v5 - type_2)
	      (pred_2 ?v8 - type_1 ?v3 - object ?v5 - type_2))

   (:action op_1
       :parameters  (?v8 - type_1 ?v1 ?v7 - type_3)
       :precondition (and  (pred_3 ?v8 ?v1))
       :effect (and  (pred_3 ?v8 ?v7)
		     (not (pred_3 ?v8 ?v1))))

   (:action op_2
       :parameters (?v8 - type_1 ?v6 - object ?v4 - type_3 ?v5 - type_2)
       :precondition  (and  (pred_4 ?v6 ?v4) (pred_3 ?v8 ?v4) (pred_1 ?v8 ?v5))
       :effect (and (pred_2 ?v8 ?v6 ?v5)
		    (not (pred_4 ?v6 ?v4)) 
		    (not (pred_1 ?v8 ?v5))))

   (:action op_3
       :parameters (?v8 - type_1 ?v6 - object ?v4 - type_3 ?v5 - type_2)
       :precondition  (and  (pred_2 ?v8 ?v6 ?v5) (pred_3 ?v8 ?v4))
       :effect (and (pred_4 ?v6 ?v4)
		    (pred_1 ?v8 ?v5)
		    (not (pred_2 ?v8 ?v6 ?v5)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_04 obj_10 - type_1
obj_09 obj_11 obj_12 obj_05 - type_2
obj_13 obj_14 obj_01 obj_06 - type_3
obj_07 obj_08 obj_02 obj_03 - object)
(:init
(pred_3 obj_04 obj_06)
(pred_1 obj_04 obj_09)
(pred_1 obj_04 obj_11)
(pred_3 obj_10 obj_14)
(pred_1 obj_10 obj_12)
(pred_1 obj_10 obj_05)
(pred_4 obj_07 obj_14)
(pred_4 obj_08 obj_06)
(pred_4 obj_02 obj_01)
(pred_4 obj_03 obj_06)
)
(:goal
(and
(pred_4 obj_07 obj_13)
(pred_4 obj_08 obj_06)
(pred_4 obj_02 obj_06)
(pred_4 obj_03 obj_14)
)
)

(:constraints
  (always (not (pred_3 obj_04 obj_01)))
)
)

; plan
1. (op_2 obj_10 obj_07 obj_14 obj_05)
   deleted: (pred_4 obj_07 obj_14) (pred_1 obj_10 obj_05)
   added: (pred_2 obj_10 obj_07 obj_05)
   goals met: 1 of 4
2. (op_2 obj_04 obj_03 obj_06 obj_11)
   deleted: (pred_4 obj_03 obj_06) (pred_1 obj_04 obj_11)
   added: (pred_2 obj_04 obj_03 obj_11)
   goals met: 1 of 4
3. (op_1 obj_10 obj_14 obj_13)
   deleted: (pred_3 obj_10 obj_14)
   added: (pred_3 obj_10 obj_13)
   goals met: 1 of 4
4. (op_1 obj_04 obj_06 obj_14)
   deleted: (pred_3 obj_04 obj_06)
   added: (pred_3 obj_04 obj_14)
   goals met: 1 of 4
5. (op_3 obj_10 obj_07 obj_13 obj_05)
   deleted: (pred_2 obj_10 obj_07 obj_05)
   added: (pred_4 obj_07 obj_13) (pred_1 obj_10 obj_05)
   goals met: 2 of 4
6. (op_3 obj_04 obj_03 obj_14 obj_11)
   deleted: (pred_2 obj_04 obj_03 obj_11)
   added: (pred_4 obj_03 obj_14) (pred_1 obj_04 obj_11)
   goals met: 3 of 4
7. (op_1 obj_10 obj_13 obj_06)
   deleted: (pred_3 obj_10 obj_13)
   added: (pred_3 obj_10 obj_06)
   goals met: 3 of 4
8. (op_1 obj_04 obj_14 obj_06)
   deleted: (pred_3 obj_04 obj_14)
   added: (pred_3 obj_04 obj_06)
   goals met: 3 of 4
9. (op_1 obj_10 obj_06 obj_01)
   deleted: (pred_3 obj_10 obj_06)
   added: (pred_3 obj_10 obj_01)
   goals met: 3 of 4
10. (op_2 obj_10 obj_02 obj_01 obj_05)
   deleted: (pred_4 obj_02 obj_01) (pred_1 obj_10 obj_05)
   added: (pred_2 obj_10 obj_02 obj_05)
   goals met: 3 of 4
11. (op_1 obj_10 obj_01 obj_06)
   deleted: (pred_3 obj_10 obj_01)
   added: (pred_3 obj_10 obj_06)
   goals met: 3 of 4
12. (op_3 obj_10 obj_02 obj_06 obj_05)
   deleted: (pred_2 obj_10 obj_02 obj_05)
   added: (pred_4 obj_02 obj_06) (pred_1 obj_10 obj_05)
   goals met: 4 of 4
